<a href="https://colab.research.google.com/github/ishizukamaaya/PYTHON/blob/main/Untitled1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [ ]:
df = pd.DataFrame([[1,2,3],[4,5,6,],[7,8,9]],
                    columns=['col01', 'col02', 'col03'],
                    index=['idx01', 'idx02', 'idx03'])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [3]:
import numpy as np

In [4]:
df = pd.DataFrame(np.array([[1,2,3],[4,5,6,],[7,8,9]]),
                    columns=['col01', 'col02', 'col03'],
                    index=['idx01', 'idx02', 'idx03'])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [ ]:
df.index

Index(['idx01', 'idx02', 'idx03'], dtype='object')

In [ ]:
df.columns

Index(['col01', 'col02', 'col03'], dtype='object')

In [ ]:
df = pd.DataFrame([[1,2,3,],
                      [4,5,6],
                      [7,8,9]])
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [ ]:
df.columns = ['col01', 'col02', 'col03']
df.index = ['idx01', 'idx02', 'idx03']

In [ ]:
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [ ]:
df.columns = ['col04', 'col05', 'col06']

In [ ]:
df

       col04  col05  col06
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [ ]:
df = df.rename(columns = {'col04': 'x'})
df

       x  y  z
idx01  1  2  3
idx02  4  5  6
idx03  7  8  9

In [ ]:
df = df.rename(columns = {'col05': 'y', 'col06': 'z'})
df

       x  y  z
idx01  1  2  3
idx02  4  5  6
idx03  7  8  9

In [ ]:
df = df.rename(index = {'idx01': 'w'})
df

       x  y  z
w      1  2  3
idx02  4  5  6
idx03  7  8  9

In [ ]:
df['x']

In [ ]:
type(df['x'])

pandas.core.series.Series

In [ ]:
df[['x']]

       x
w      1
idx02  4
idx03  7

In [ ]:
type(df[['x']])

pandas.core.frame.DataFrame

In [ ]:
df.loc['w']

x    1
y    2
z    3
Name: w, dtype: int64

In [ ]:
df.loc['idx02']

x    4
y    5
z    6
Name: idx02, dtype: int64

In [ ]:
df.loc['w','y']

2

In [ ]:
df.loc[:,'col01']

idx01    1
idx02    4
idx03    7
Name: col01, dtype: int64

In [ ]:
df.iloc[:,0]

idx01    1
idx02    4
idx03    7
Name: col01, dtype: int64

In [5]:
df = pd.DataFrame(np.array([[1,2,3],[4,5,6,],[7,8,9]]),
                    columns=['col01', 'col02', 'col03'],
                    index=['idx01', 'idx02', 'idx03'])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [6]:
df.loc['idx03','col02']

8

In [7]:
df.loc['idx03','col02'] = 100
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7    100      9

In [8]:
df.loc[:,'col03'] = ['Tokyo','Osaka','Hokkaido']
df

       col01  col02     col03
idx01      1      2     Tokyo
idx02      4      5     Osaka
idx03      7    100  Hokkaido

In [10]:
df.loc[:,'col02':'col03']

       col02     col03
idx01      2     Tokyo
idx02      5     Osaka
idx03    100  Hokkaido

In [11]:
df.iloc[:,1:3]

       col02     col03
idx01      2     Tokyo
idx02      5     Osaka
idx03    100  Hokkaido

In [12]:
df.index.get_loc('idx03')

2

In [14]:
df.columns.get_loc('col02')

1

In [17]:
df.iloc[df.index.get_loc('idx03'),df.columns.get_loc('col02')] = 1000
df

       col01  col02     col03
idx01      1      2     Tokyo
idx02      4      5     Osaka
idx03      7   1000  Hokkaido

In [19]:
df.dtypes

col01     int64
col02     int64
col03    object
dtype: object

In [20]:
df.shape

(3, 3)

In [21]:
df.T

       idx01  idx02     idx03
col01      1      4         7
col02      2      5      1000
col03  Tokyo  Osaka  Hokkaido